# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа 
# сделали одинаковое количество журавликов, а Катя сделала в два раза больше 
# журавликов, чем Петя и Сережа вместе?

# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
#  60 -> 10  40  10


S = int(input("Введите количество журавликов: "))

while  S % 6 != 0:
    print("Ошибка!Количество журавликов должно быть кратно 6")
    S = int(input("Введите количество журавликов:"))
n = S // 6
print(f"Петя сделал {n}, Катя сделала {(n + n)*2}, Сережа сделал {n}")